bubbleColumn2/0/nut.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-8;

boundaryField
{
    sideLeft
    {
        type            symmetryPlane;
    }

    sideRight
    {
        type            calculated;
        value           $internalField;
    }
    topbottom
    {
    	type            empty;
	//value           $internalField;
    }
    frontback
    {
    	type            empty;
	//value           $internalField;
    }  
    //defaultFaces
    //{
        //type            empty;
    //}
}

// ************************************************************************* //
